---
title: ImageBackgroundSettings
classe: Autodesk.Revit.DB.ImageBackgroundSettings
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.BackgroundSettings
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ImageBackgroundSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `BackgroundImageFit BackgroundImageFit { get; set; }` | `imageBackgroundSettings.BackgroundImageFit` | BackgroundImageFit |
| `String FilePath { get; set; }` | `imageBackgroundSettings.FilePath` | String |
| `Double OffsetHeight { get; set; }` | `imageBackgroundSettings.OffsetHeight` | Double |
| `Double OffsetWidth { get; set; }` | `imageBackgroundSettings.OffsetWidth` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```